:PROPERTIES:
:ID:       8f853c3f-a42c-4d43-8015-a41313fe2d9b
:END:
#+TITLE: Astronomy
#+DESCRIPTION: 
#+TAGS:

* Docs

* Resources
** Cheatsheets
+ [[https://nssdc.gsfc.nasa.gov/planetary/factsheet/][Planetary Fact Sheet]]
** Data Sources

More in [[id:676fa714-05d2-4422-b23e-1a97637ff161][NASA]] (org-roam link)

*** University
+ [[https://guides.lib.calpoly.edu/c.php?g=261997&p=1749394][Caltech Data Sources: Astronomy]]
+ [[https://guides.lib.berkeley.edu/c.php?g=49013&p=315440][Berkeley Library: Astronomy and Astrophysics Data Sources]]

*** NOAA
+ [[https://www.ncei.noaa.gov/services/world-data-system][World Data System]]

*** [[https://www.astronexus.com/][Astronomy Nexus]]
+ [[astronexus/ATHYG-Database]]
+ [[github:astronexus/HYG-Database][astronexus/HYG-Database]]

* Topics

** Stats

*** From [[https://nssdc.gsfc.nasa.gov/planetary/factsheet/][Planetary Fact Sheet]]

***** TODO double check numbers .....

#+begin_quote
*NOTE*: I need to run through these and doublecheck the numbers, as I was manually
converting things so that units could be extracted & multiplied.

I never finished, so even the columns are likely messed up
#+end_quote

avoid subsequent conversions by consolidating units. add =magnitude + conv= to
adjust to value in =pfacts= table

+ magnitude :: power of ten adjusting magnitude of SI units.
+ conv :: power of ten for unit conversion

#+name: planetFacts
| ! | desc                 | latex            | var    | magnitude |           conv | mercury |   venus |  earth |  moon |  mars | jupiter |  saturn | uranus | neptune |   pluto |
|---+----------------------+------------------+--------+-----------+----------------+---------+---------+--------+-------+-------+---------+---------+--------+---------+---------|
|   | Mass                 | $kg * 10^{24}$   | m      |        24 |              0 |   0.330 |    4.87 |   5.97 | 0.073 | 0.642 |    1898 |     568 |   86.8 |     102 |  0.0130 |
|   | Diameter             | $km$             | D      |         3 | 0.301029995664 |    4879 |  12,104 | 12,756 |  3475 |  6792 | 142,984 | 120,536 | 51,118 |  49,528 |    2376 |
|   | Density              | $\frac{km}{m^3}$ | ρ      |         0 |              0 |    5429 |    5243 |   5514 |  3340 |  3934 |    1326 |     687 |   1270 |    1638 |    1850 |
|   | Gravity              | $\frac{m}{s^2}$  | g      |         0 |              0 |     3.7 |     8.9 |    9.8 |   1.6 |   3.7 |    23.1 |     9.0 |    8.7 |    11.0 |     0.7 |
|   | Escape Velocity      | $\frac{km}{s}$   | v_e    |         3 |              0 |     4.3 |    10.4 |   11.2 |   2.4 |   5.0 |    59.5 |    35.5 |   21.3 |    23.5 |     1.3 |
|   | Rotation Period      | $h$              | T_r    |         0 |  3.55630250077 |  1407.6 | -5832.5 |   23.9 | 655.7 |  24.6 |     9.9 |    10.7 |  -17.2 |    16.1 |  -153.3 |
|   | Length of Day        | $h$              | T_d    |         0 |  3.55630250077 |  4222.6 |  2802.0 |   24.0 | 708.7 |  24.7 |     9.9 |    10.7 |   17.2 |    16.1 |   153.3 |
|   | Distance from Sun    | $km * 10^6$      | d_sun  |         9 |              0 |    57.9 |   108.2 |  149.6 | 0.384 | 228.0 |   778.5 |  1432.0 | 2867.0 |  4515.0 |  5906.4 |
|   | Perihelion           | $km * 10^6$      | d_peri |         9 |              0 |    46.0 |   107.5 |  147.1 | 0.363 | 206.7 |   740.6 |  1357.6 | 2732.7 |  4471.1 |  4436.8 |
|   | Aphelion             | $km * 10^6$      | d_aphe |         9 |              0 |    69.8 |   108.9 |  152.1 | 0.406 | 249.3 |   816.4 |  1506.5 | 3001.4 |  4558.9 |  7375.9 |
|   | Orbital Period       | $d$              | T_o    |         0 |  4.93651374248 |    88.0 |   224.7 |  365.2 |  27.3 | 687.0 |    4331 |  10,747 | 30,589 |  59,800 |  90,560 |
|   | Orbital Velocity     | $\frac{km}{s}$   | v_O    |         3 |              0 |    47.4 |    35.0 |   29.8 |   1.0 |  24.1 |    13.1 |     9.7 |    6.8 |     5.4 |     4.7 |
|   | Orbital Inclination  | $^{\circ}$       | O_i    |         0 | -1.75812263241 |     7.0 |     3.4 |    0.0 |   5.1 |   1.8 |     1.3 |     2.5 |    0.8 |     1.8 |    17.2 |
|   | Orbital Eccentricity | $\varnothing$    | O_e    |         0 |              0 |   0.206 |   0.007 |  0.017 | 0.055 | 0.094 |   0.049 |   0.052 |  0.047 |   0.010 |   0.244 |
|   | Obliquity to Orbit   | $^{\circ}$       | O_o    |         0 | -1.75812263241 |   0.034 |   177.4 |   23.4 |   6.7 |  25.2 |     3.1 |    26.7 |   97.8 |    28.3 |   119.5 |
|   | Mean Temperature     | $^{\circ}C$      | μ_T    |         0 |              0 |     167 |     464 |     15 |   -20 |   -65 |    -110 |    -140 |   -195 |    -200 |    -225 |
|   | Surface Pressure     | $bars$           | P      |         5 |              0 |       0 |      92 |      1 |     0 |  0.01 |         |         |        |         | 0.00001 |
|   | Number of Moons      | $n$              | n_moon |         0 |              0 |       0 |       0 |      1 |     0 |     2 |      95 |     146 |     28 |      16 |       5 |
|---+----------------------+------------------+--------+-----------+----------------+---------+---------+--------+-------+-------+---------+---------+--------+---------+---------|
| 1 |                      |                  |        |           |                |         |         |        |       |       |         |         |        |         |         |
#+TBLFM: @>$1=$10+1

#+name: planetMisc
| desc                   | mercury |   venus |  earth |  moon |  mars | jupiter |  saturn | uranus | neptune |   pluto |
|------------------------+---------+---------+--------+-------+-------+---------+---------+--------+---------+---------|
| Ring System?           |      No |      No |     No |    No |    No |     Yes |     Yes |    Yes |     Yes |      No |
| Global Magnetic Field? |     Yes |      No |    Yes |    No |    No |     Yes |     Yes |    Yes |     Yes | Unknown |

#+name: pfacts
| ! | var    | unit       | magnitude |                               | mercury |   venus |  earth |  moon |  mars | jupiter |  saturn |  uranus | neptune |   pluto |
|---+--------+------------+-----------+-------------------------------+---------+---------+--------+-------+-------+---------+---------+---------+---------+---------|
|   | m      | kg         |         0 | Mass                          |   0.330 |    4.87 |   5.97 | 0.073 | 0.642 |    1898 |     568 |    86.8 |     102 |  0.0130 |
|   | D      | m          |         0 | Radius (m)                    |    4879 |  12,104 | 12,756 |  3475 |  6792 | 142,984 | 120,536 |  51,118 |  49,528 |    2376 |
|   | ρ      | kg/(m*m*m) |         0 | Density (kg/m3)               |    5429 |    5243 |   5514 |  3340 |  3934 |    1326 |     687 |    1270 |    1638 |    1850 |
|   | g      | m/(s*s)    |         0 | Gravity (m/s2)                |     3.7 |     8.9 |    9.8 |   1.6 |   3.7 |    23.1 |     9.0 |     8.7 |    11.0 |     0.7 |
|   | v_e    | m*s        |         0 | Escape Velocity (km/s)        |     4.3 |    10.4 |   11.2 |   2.4 |   5.0 |    59.5 |    35.5 |    21.3 |    23.5 |     1.3 |
|   | T_r    | h          |         0 | Rotation Period (hours)       |  1407.6 | -5832.5 |   23.9 | 655.7 |  24.6 |     9.9 |    10.7 |   -17.2 |    16.1 |  -153.3 |
|   | T_d    | h          |         0 | Length of Day (hours)         |  4222.6 |  2802.0 |   24.0 | 708.7 |  24.7 |     9.9 |    10.7 |    17.2 |    16.1 |   153.3 |
|   | d_sun  | m          |         0 | Distance from Sun (106 km)    |    57.9 |   108.2 |  149.6 | 0.384 | 228.0 |   778.5 |  1432.0 |  2867.0 |  4515.0 |  5906.4 |
|   | d_peri | m          |         0 | Perihelion (106 km)           |    46.0 |   107.5 |  147.1 | 0.363 | 206.7 |   740.6 |  1357.6 |  2732.7 |  4471.1 |  4436.8 |
|   | d_aphe | m          |         0 | Aphelion (106 km)             |    69.8 |   108.9 |  152.1 | 0.406 | 249.3 |   816.4 |  1506.5 |  3001.4 |  4558.9 |  7375.9 |
|   | T_o    | d          |         0 | Orbital Period (days)         |    88.0 |   224.7 |  365.2 |  27.3 | 687.0 |    4331 |  10,747 |  30,589 |  59,800 |  90,560 |
|   | v_O    | m*s        |         0 | Orbital Velocity (km/s)       |    47.4 |    35.0 |   29.8 |   1.0 |  24.1 |    13.1 |     9.7 |     6.8 |     5.4 |     4.7 |
|   | O_i    | deg        |         0 | Orbital Inclination (degrees) |     7.0 |     3.4 |    0.0 |   5.1 |   1.8 |     1.3 |     2.5 |     0.8 |     1.8 |    17.2 |
|   | O_e    | 1          |         0 | Orbital Eccentricity          |   0.206 |   0.007 |  0.017 | 0.055 | 0.094 |   0.049 |   0.052 |   0.047 |   0.010 |   0.244 |
|   | O_o    | deg        |         0 | Obliquity to Orbit (degrees)  |   0.034 |   177.4 |   23.4 |   6.7 |  25.2 |     3.1 |    26.7 |    97.8 |    28.3 |   119.5 |
|   | μ_T    | C          |         0 | Mean Temperature (C)          |     167 |     464 |     15 |   -20 |   -65 |    -110 |    -140 |    -195 |    -200 |    -225 |
|   | P      | Pa         |         0 | Surface Pressure (bars)       |       0 |      92 |      1 |     0 |  0.01 | Unknown | Unknown | Unknown | Unknown | 0.00001 |


**** Max/Min Distance from Earth

| Perihelion (106 km) | 46.0 | 107.5 | 147.1 | 0.363* | 206.7 | 740.6 | 1357.6 | 2732.7 | 4471.1 | 4436.8 |
| Aphelion (106 km)   | 69.8 | 108.9 | 152.1 | 0.406* | 249.3 | 816.4 | 1506.5 | 3001.4 | 4558.9 | 7375.9 |
 
* Roam
